package day06to10;

	/*https://blog.naver.com/boaconic29383/222658613821
	 디버깅 오류 설명
	 */
		
		/*
		리스트를 쓰기위한 코드는 아래와 같다
		ArrayList<String> arr = new ArrayList<>();
		*/
		
		/*
		랜덤 뒤에 연산을 하는 숫자는 그 숫자의 갯수만큼 숫자를 만들겠다는 의미로
		3을 하면 0-2까지 3개의 숫자를 뽑는다. 0부터 시작함 주의
		*/
		
		/*ArrayList도 대문자로 시작하는 자료형이기 때문에 .  기능을 사용할 수 있다
		내용의 중복이 가능하고 제한없이 내용을 추가,가감 할 수 있다.*/
		
		//배열이 리스트보다 처리속도가 빠르다
		
		// 변수.add() 내용을 추가한다.
		// 변수.get() 괄호 안 인덱스넘버의 값을 출력
		// 변수.size() 해당변수의 값의 갯수를 출력 (배열의 length)
		
		/* ArrayList의 size는 배열의 length 와 같다.
		하지만 리스트에서는 size만 사용할 수 있고, 배열에서는 length만 사용할 수 있다.*/
		
		// 변수.remove() 인덱스넘버를 넣으면 그 자리의 값을, 값을 똑같이 입력하면 그 값을 지운다.
		
		/*리스트는 공간을 유연하게 사용한다. 내용 추가나 삭제가 제한이 없고,
		내용이 사라지거나 생기면 기존 값의 인덱스넘버가 바뀌기도 한다*/
		
		// 변수.contains() 괄호안의 값이 .앞의 변수에 존재하는지 True False로 출력해 알려준다. (배열의 equals)
		// 변수.indexOf() 괄호안의 값이 .앞의 변수에 존재한다면 그 값의 위치 인덱스 번호를 출력한다.
		/* 변수.set(1,2) 변수의 값1번을 2로 변경한다. 
		1번은 인덱스 넘버여야 하고, 2번은 바꿀 값을 입력한다.*/
		
