package day01to05;

public class Summary04_for {

}
//백준알고리즘-문제 풀어볼 수 있음

/*for 반복문
;세미콜론 2개 필수다.
기본형태는 for(초기문;조건문;증감문) 형태인데
괄호안의 모든 제어문이 생략이 가능하지만 세미콜론은 적어주어야 오류가 안난다.
for( ; ; ) 같이 모든 지시문을 생략하면 무한반복이 된다.

실행의 순서는 초기문>조건식>(참일때)종속코드수행>증감식>조건식>(참일때)종속코드수행>증감식... 순이다.
참이면 계속 반복되고 거짓이면 종속코드에서 나와 다음코드를 실행

초기문을 확인 후 조건식이 참이면 코드실행,
증감식으로 돌아와서 증감식 수행 후 조건식 맞는지 확인.
조건문이 거짓이 되면 반복이 멈추며 다음코드 실행*/

/*파일 만들때 package 는 폴더같은 역할*/

//반복문은 코드의 반복을 위해, 또는 코드의 값이 규칙이 있을때 사용할 수 있다

/*반복문같이 안에서 작용한는 코드를 눈으로 확인할 수 있는게 디버깅모드 실행
F11 : 디버깅 시작 모드
F6 : 한줄씩 실행(메소드 건너뜀) 
F7 : 한줄씩 실행(메소드로 이동)
F8 : 다음 브레이크 포인터로 이동
Ctrl + f2 : 디버깅모드 종료

현재 페이지의 파란라인을 더블클릭하면 포인터가 생기는데
디버깅 모드의 멈추는 포인트, 시작 포인트 정하는것
시작 포인트로 보는게 편함
*/

//Ctrl+a , Ctrl+i > 전체 잡고 정렬하는것. 중괄호가 적거나 많으면 오류가 난다

/*랜덤한 함수를 여러번 랜덤하게 뽑으려면 Math.random 코드도 반복문에 안에 들어가 있어야 한다.
반복문 밖에 있으면 반복이 되지 않아서 한번만 랜덤한 함수를 뽑는다.*/




