package day01to05;

public class Summary01 {

}

//

/*Ctrl+N 파일 생성할때 쓰는 단축키, 창이뜨면 검색으로 원하는 프로그램을 찾을 수 있다
첫 시작부분에서 사용할 수 있고, src를 클릭해놓은 상태로 사용할 수 있다
지금 프로그램은 Java Project에서 Class로 만들었다.*/

/*영문이름을 지을때에 첫문자와 합성어의 첫문자는 대문자로 쓰는것이 규칙 ex) TestClass*/

/*main 프로그램 시작점
public class 옆에 파일생성시 입력한 파일명이 뜨는데, 코드창에서 수정하면 안된다.
파일명을 바꾸고 싶으면 왼쪽 리스트에서 선택 후 F2로 수정할 수 있다*/

/*Ctrl+Spacebar는 자동완성. 시작시 사용하는 main에 쓰면
public static void main(String[] args){}
위 코드가 자동완성되며, 파일만들때 기본적으로 꼭 쓰는 코드이다.
이후 코드들을 {}중괄호 안에 써야한다.

sysout후 자동완성을 쓰면 출력코드가 된다.
System.out.println();
위 코드의 .println의 ln은 엔터(개행)효과이고,
ln을 지우고 print만 쓰면 코드들끼리 개행이 되어있어도 출력값이 전부 붙어서 나온다.*/

/* 긴문장 주석시 사용하는 */

/*Ctrl+D 는 한줄삭제
실행키는 Ctrl+F11 그냥 F11만 누르면 디버깅모드로 실행되기 때문에 다른 용도이다.*/

/*Escape 문자
문자열 안에서 사용하며 문자열 안에서 특수한 기능을 한다.
""큰따옴표 안에 적어야 그 기능을 할 뿐더러 오류가 안난다.

\n 은 엔터(개행)효과
\t 는 Tab효과(8칸의 여백을 만든다)
\" "큰따옴표를 출력한다
\\ \역슬래쉬를 출력한다*/

/*문자와 숫자를 더하면 나란히 붙어서 나온다.
아래의 예시는 문자 + 숫자1 + 숫자2 인데, 대강 보면 숫자끼리 더한 이후
문자+숫자12가 나올것 같지만

System.out.println("안녕" + 100 + 100);
사칙연산은 앞의 것을 먼저 계산하는 규칙으로 안녕과 100을 먼저 더해서 "안녕100"인 문자와 숫자 100을 더하는 결과가 나옴*/

/*문자와 숫자는 이어쓰려면 +가 필요하다.
 
폴더에 있는 파일이 이클립스에서 보이지 않거나 들어오지 않았다면 왼쪽리스트에서 폴더 선택 후 F5(새로고침)*/





